nevinxu/HM502B2/platform/CMSIS/Include/device/MKL27Z4/MKL27Z4_i2c.h
/*
 * Constants & macros for individual I2C_SLTH bitfields
 */

/*!
 * @name Register I2C_SLTH, field SSLT[7:0] (RW)
 *
 * Most significant byte of SCL low timeout value that determines the timeout
 * period of SCL low.
 */
/*@{*/
#define BP_I2C_SLTH_SSLT     (0U)          /*!< Bit position for I2C_SLTH_SSLT. */
#define BM_I2C_SLTH_SSLT     (0xFFU)       /*!< Bit mask for I2C_SLTH_SSLT. */
#define BS_I2C_SLTH_SSLT     (8U)          /*!< Bit field size in bits for I2C_SLTH_SSLT. */

/*! @brief Read current value of the I2C_SLTH_SSLT field. */
#define BR_I2C_SLTH_SSLT(x)  (HW_I2C_SLTH(x).U)

/*! @brief Format value for bitfield I2C_SLTH_SSLT. */
#define BF_I2C_SLTH_SSLT(v)  ((uint8_t)((uint8_t)(v) << BP_I2C_SLTH_SSLT) & BM_I2C_SLTH_SSLT)

/*! @brief Set the SSLT field to a new value. */
#define BW_I2C_SLTH_SSLT(x, v) (HW_I2C_SLTH_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_I2C_SLTL - I2C SCL Low Timeout Register Low
 ******************************************************************************/

/*!
 * @brief HW_I2C_SLTL - I2C SCL Low Timeout Register Low (RW)
 *
 * Reset value: 0x00U
 */
typedef union _hw_i2c_sltl
{
    uint8_t U;
    struct _hw_i2c_sltl_bitfields
    {
        uint8_t SSLT : 8;              /*!< [7:0] SSLT[7:0] */
    } B;
} hw_i2c_sltl_t;

/*!
 * @name Constants and macros for entire I2C_SLTL register
 */
/*@{*/
#define HW_I2C_SLTL_ADDR(x)      ((x) + 0xBU)

#define HW_I2C_SLTL(x)           (*(__IO hw_i2c_sltl_t *) HW_I2C_SLTL_ADDR(x))
#define HW_I2C_SLTL_RD(x)        (HW_I2C_SLTL(x).U)
#define HW_I2C_SLTL_WR(x, v)     (HW_I2C_SLTL(x).U = (v))
#define HW_I2C_SLTL_SET(x, v)    (BME_OR8(HW_I2C_SLTL_ADDR(x), (uint8_t)(v)))
#define HW_I2C_SLTL_CLR(x, v)    (BME_AND8(HW_I2C_SLTL_ADDR(x), (uint8_t)(~(v))))
#define HW_I2C_SLTL_TOG(x, v)    (BME_XOR8(HW_I2C_SLTL_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual I2C_SLTL bitfields
 */

/*!
 * @name Register I2C_SLTL, field SSLT[7:0] (RW)
 *
 * Least significant byte of SCL low timeout value that determines the timeout
 * period of SCL low.
 */
/*@{*/
#define BP_I2C_SLTL_SSLT     (0U)          /*!< Bit position for I2C_SLTL_SSLT. */
#define BM_I2C_SLTL_SSLT     (0xFFU)       /*!< Bit mask for I2C_SLTL_SSLT. */
#define BS_I2C_SLTL_SSLT     (8U)          /*!< Bit field size in bits for I2C_SLTL_SSLT. */

/*! @brief Read current value of the I2C_SLTL_SSLT field. */
#define BR_I2C_SLTL_SSLT(x)  (HW_I2C_SLTL(x).U)

/*! @brief Format value for bitfield I2C_SLTL_SSLT. */
#define BF_I2C_SLTL_SSLT(v)  ((uint8_t)((uint8_t)(v) << BP_I2C_SLTL_SSLT) & BM_I2C_SLTL_SSLT)

/*! @brief Set the SSLT field to a new value. */
#define BW_I2C_SLTL_SSLT(x, v) (HW_I2C_SLTL_WR(x, v))
/*@}*/

/*******************************************************************************
 * HW_I2C_S2 - I2C Status register 2
 ******************************************************************************/

/*!
 * @brief HW_I2C_S2 - I2C Status register 2 (RW)
 *
 * Reset value: 0x01U
 */
typedef union _hw_i2c_s2
{
    uint8_t U;
    struct _hw_i2c_s2_bitfields
    {
        uint8_t EMPTY : 1;             /*!< [0] Empty flag */
        uint8_t ERROR : 1;             /*!< [1] Error flag */
        uint8_t RESERVED0 : 6;         /*!< [7:2]  */
    } B;
} hw_i2c_s2_t;

/*!
 * @name Constants and macros for entire I2C_S2 register
 */
/*@{*/
#define HW_I2C_S2_ADDR(x)        ((x) + 0xCU)

#define HW_I2C_S2(x)             (*(__IO hw_i2c_s2_t *) HW_I2C_S2_ADDR(x))
#define HW_I2C_S2_RD(x)          (HW_I2C_S2(x).U)
#define HW_I2C_S2_WR(x, v)       (HW_I2C_S2(x).U = (v))
#define HW_I2C_S2_SET(x, v)      (BME_OR8(HW_I2C_S2_ADDR(x), (uint8_t)(v)))
#define HW_I2C_S2_CLR(x, v)      (BME_AND8(HW_I2C_S2_ADDR(x), (uint8_t)(~(v))))
#define HW_I2C_S2_TOG(x, v)      (BME_XOR8(HW_I2C_S2_ADDR(x), (uint8_t)(v)))
/*@}*/

/*
 * Constants & macros for individual I2C_S2 bitfields
 */

/*!
 * @name Register I2C_S2, field EMPTY[0] (RO)
 *
 * Indicates if the Tx or Rx buffer is empty.
 *
 * Values:
 * - 0 - Tx or Rx buffer is not empty and cannot be written to, that is new data
 *     cannot be loaded into the buffer.
 * - 1 - Tx or Rx buffer is empty and can be written to, that is new data can be
 *     loaded into the buffer.
 */
/*@{*/
#define BP_I2C_S2_EMPTY      (0U)          /*!< Bit position for I2C_S2_EMPTY. */
#define BM_I2C_S2_EMPTY      (0x01U)       /*!< Bit mask for I2C_S2_EMPTY. */
#define BS_I2C_S2_EMPTY      (1U)          /*!< Bit field size in bits for I2C_S2_EMPTY. */

/*! @brief Read current value of the I2C_S2_EMPTY field. */
#define BR_I2C_S2_EMPTY(x)   (BME_UBFX8(HW_I2C_S2_ADDR(x), BP_I2C_S2_EMPTY, BS_I2C_S2_EMPTY))
/*@}*/

/*!
 * @name Register I2C_S2, field ERROR[1] (W1C)
 *
 * Indicates if there are read or write errors with the Tx and Rx buffers.
 *
 * Values:
 * - 0 - The buffer is not full and all write/read operations have no errors.
 * - 1 - There are 3 or more write/read errors during the data transfer phase
 *     (when the Empty flag is not set and the buffer is busy).
 */
/*@{*/
#define BP_I2C_S2_ERROR      (1U)          /*!< Bit position for I2C_S2_ERROR. */
#define BM_I2C_S2_ERROR      (0x02U)       /*!< Bit mask for I2C_S2_ERROR. */
#define BS_I2C_S2_ERROR      (1U)          /*!< Bit field size in bits for I2C_S2_ERROR. */

/*! @brief Read current value of the I2C_S2_ERROR field. */
#define BR_I2C_S2_ERROR(x)   (BME_UBFX8(HW_I2C_S2_ADDR(x), BP_I2C_S2_ERROR, BS_I2C_S2_ERROR))

/*! @brief Format value for bitfield I2C_S2_ERROR. */
#define BF_I2C_S2_ERROR(v)   ((uint8_t)((uint8_t)(v) << BP_I2C_S2_ERROR) & BM_I2C_S2_ERROR)

/*! @brief Set the ERROR field to a new value. */
#define BW_I2C_S2_ERROR(x, v) (BME_BFI8(HW_I2C_S2_ADDR(x), ((uint8_t)(v) << BP_I2C_S2_ERROR), BP_I2C_S2_ERROR, 1))
/*@}*/

/*******************************************************************************
 * hw_i2c_t - module struct
 ******************************************************************************/
/*!
 * @brief All I2C module registers.
 */
#pragma pack(1)
typedef struct _hw_i2c
{
    __IO hw_i2c_a1_t A1;                   /*!< [0x0] I2C Address Register 1 */
    __IO hw_i2c_f_t F;                     /*!< [0x1] I2C Frequency Divider register */
    __IO hw_i2c_c1_t C1;                   /*!< [0x2] I2C Control Register 1 */
    __IO hw_i2c_s_t S;                     /*!< [0x3] I2C Status register */
    __IO hw_i2c_d_t D;                     /*!< [0x4] I2C Data I/O register */
    __IO hw_i2c_c2_t C2;                   /*!< [0x5] I2C Control Register 2 */
    __IO hw_i2c_flt_t FLT;                 /*!< [0x6] I2C Programmable Input Glitch Filter Register */
    __IO hw_i2c_ra_t RA;                   /*!< [0x7] I2C Range Address register */
    __IO hw_i2c_smb_t SMB;                 /*!< [0x8] I2C SMBus Control and Status register */
    __IO hw_i2c_a2_t A2;                   /*!< [0x9] I2C Address Register 2 */
    __IO hw_i2c_slth_t SLTH;               /*!< [0xA] I2C SCL Low Timeout Register High */
    __IO hw_i2c_sltl_t SLTL;               /*!< [0xB] I2C SCL Low Timeout Register Low */
    __IO hw_i2c_s2_t S2;                   /*!< [0xC] I2C Status register 2 */
} hw_i2c_t;
#pragma pack()

/*! @brief Macro to access all I2C registers. */
/*! @param x I2C module instance base address. */
/*! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
 *     use the '&' operator, like <code>&HW_I2C(I2C0_BASE)</code>. */
#define HW_I2C(x)      (*(hw_i2c_t *)(x))

#endif /* __HW_I2C_REGISTERS_H__ */
/* EOF */
